;Завдання 6 (1)
	ldi r16, $10    ; Загрузка значения 16 в регистр R16
	BEGIN:
    ldi r22, 17	 ; Загрузка значення 17 в регістр R11
    ldi r23, 18	 ; Загрузка значення 18 в регістр R12
	ldi r24, 19	 ; Загрузка значення 19 в регістр R13
	ldi r17, 20  ; Загрузка значення 20 в регістр R17
	mov r12, r17 ; Загрузка значення R17 в регістр R12
	ldi r17, 21  ; Загрузка значення 21 в регістр R17
	mov r15, r17 ; Загрузка значення R17 в регістр R15
	ldi r17, 22  ; Загрузка значення 22 в регістр R17
	mov r14, r17 ; Загрузка значення R17 в регістр R14

    sbrs r16, 6      ; Перевірка 6го біту
	brne label

	mov   R22, R12	 ; Копіювання значень з R12 в R22            
    mov   R23, R15   ; Копіювання значень з R13 в R23          
    mov   R24, R14   ; Копіювання значень з R14 в R24 
	jmp   copy_end

	label:
	mov   R12, R22   ; Копирование значения из R22 в R12
    mov   R15, R23   ; Копирование значения из R23 в R15
    mov   R14, R24   ; Копирование значения из R24 в R14
    jmp   copy_end 

	copy_end:
    ret
